import {Box} from "@mui/material";

export const faqQuestions = [
	{
		question: 'Як Я Можу Отримати Протез Руки Victoria Hand?',
		answer:
			<Box>
				Якщо ви зацікавлені в отриманні одного з протезів VHP, вам потрібно почати з запису на прийом до нас або до
				одного з наших клінічних партнерів. Під час цього початкового прийому вам пояснять, як працює система VHP, які
				типи пристроїв найкраще підходять для вашого способу життя, які функціональні обмеження у вас можуть бути.
				<br/>
				<br/>
				Наші сертифіковані партнери з протезування працюватимуть безпосередньо з кожним одержувачем для вимірювань,
				зняття відбитків гіпсу, підгонки та навчання користуванню новою рукою.
			</Box>
	},
	{
		question: 'Яку Гарантію Ви Пропонуєте На Зброю VHP?',
		answer: 'Ми пропонуємо 1 рік гарантії на наші протези рук. '
	},
	{
		question: 'Які Послуги Та Ремонт Ви Пропонуєте?',
		answer:
			<Box>
				Ми забезпечуємо постійну технічну підтримку для кожного одержувача та реалізуємо зворотний зв’язок із
				користувачами та клінічними фахівцями для постійного розвитку технології. Це забезпечить якісне обслуговування
				Вашого протеза руки, необхідне для нормальної та тривалої роботи Вашого пристрою.
				<br/>
				<br/>
				Якщо щось зламано або не працює належним чином, наша 3D-технологія дозволяє повторно надрукувати зламані
				частини та швидко й легко замінити їх. Це також можна зробити, якщо ваша кінцівка переросла. Наші майстри
				виконають весь необхідний ремонт.
			</Box>
	},
	{
		question: 'Як Я Можу Стати Клінічним Партнером?',
		answer:
			<Box>
				Щоб стати клінічним партнером IMTU, вам потрібно пройти навчання в IMTU для роботи з пацієнтами, з обладнанням
				для 3D-друку та сканування, програмним забезпеченням автоматизованого проектування (CAD), яке дозволить вам
				виготовляти високоякісні індивідуальні протези – швидше, дешевше – ефективно та ефективніше, ніж будь-коли
				раніше.
				<br/>
				<br/>
				{/* eslint-disable-next-line react/no-unescaped-entities */}
				Будь ласка, зв'яжіться з нами електронною поштою або телефоном, щоб дізнатися про співпрацю.
			</Box>
	},
];