export const featuresList = [
	'За допомогою 3D-друку всі пластикові деталі можна надрукувати на вимогу, на місці в країні, використовуючи ' +
	'високоякісну нитку PLA виробництва BASF/Forward AM. Цей матеріал біологічно розкладається та сертифікований для ' +
	'тривалого контакту зі шкірою людини.',

	'У системі VHP використовуються компоненти та кріплення з нержавіючої сталі, щоб зробити всю систему міцнішою та ' +
	'довговічнішою.',

	'Використовуючи 3D-сканування, гніздо повністю налаштовується відповідно до кожного окремого пацієнта з ампутованими ' +
	'кінцівками/користувача.',

	'Рука має зап’ястя з кульковим гніздом, її можна орієнтувати та фіксувати в різних положеннях.',

	'Кожна рука має п’ять пальців адаптивного захоплення, і рука може схоплювати багато різних форм предметів.',

	'Кожна рука має м\'які силіконові кінчики пальців, які допомагають утримувати предмети без ковзання.',

	'Рука має поворотний великий палець, який допомагає більш надійно захоплювати різні предмети.',

	'Руку за бажанням можна пофарбувати фарбою в тон шкіри.',

	'У разі необхідності ремонту або обслуговування всі деталі можна повторно надрукувати на 3D-принтері, що робить цю' +
	' систему дуже гнучкою, економічною та простою у догляді.'
]