import {Typography} from "@mui/material";

export const handSystemsDescriptions = [
	{
		title: 'Добровільне закриття руки (VC Hand)',
		text:
			<Typography>
				Система добровільного закриття руки залишається відкритою до моменту, коли користувач піднімає своє плече,
				активує руку та стискує пальці руки.
				<br/>
				<br/>
				Цей тип найбільш популярний серед пацієнтів, які втратили перевагу, і є ідеальним вибором для багатьох
				користувачів, особливо для тих, хто тільки почав використовувати цю систему.
			</Typography>,
	},

	{
		title: 'Добровільна відкрита рука (VO Hand)',
		text:
			<Typography>
				Система добровільного закриття руки залишається відкритою до моменту, коли користувач піднімає своє плече,
				активує руку та стискує пальці руки.
				<br/>
				<br/>
				Цей тип найбільш популярний серед пацієнтів, які втратили перевагу, і є ідеальним вибором для багатьох
				користувачів, особливо для тих, хто тільки почав використовувати цю систему.
			</Typography>,
	},

	{
		title: 'Мала рука',
		text: 'Система Small Hand — це зменшена версія системи Voluntary Close Hand, яка оптимізована для дітей або ' +
			'користувачів з невеликими руками. Окрім внутрішньої конструкції пальців із нержавіючої сталі, Small Hand має ' +
			'великий палець із нержавіючої сталі, що робить руку довговічною.',
	},

	{
		title: 'Рука LimbForge',
		text: 'Рука LimbForge   — це косметичний, надлегкий протез руки, надрукований на 3D-принтері. Руку й руку можна ' +
			'масштабувати так, щоб вона ідеально відповідала розмірам тіла одержувача.',
	},

	{
		title: 'Допоміжні додатки',
		text: 'Invictus Medical також пропонує набір допоміжних додатків. Ці 3D-друковані пристрої можна тримати системами ' +
			'Victoria Hands, щоб полегшити виконання конкретних завдань і забезпечити кращий комфорт і незалежність для ' +
			'людей з ампутованими кінцівками.',
	}
];