import addOn1 from '../../../../../public/images/add-ons-1.jpg';
import addOn2 from '../../../../../public/images/add-ons-2.jpg';
import addOn3 from '../../../../../public/images/add-ons-3.jpg';

export const addOnsDescriptions = [
	{
		image: addOn1,
		title: 'Допоміжний пристрій для письма',
		text: 'Цей пристрій був розроблений, щоб допомогти тримати та використовувати письмове приладдя. Пристрій може ' +
			'вміщати низку невеликого письмового приладдя та може бути особливо корисним для використання в школі чи на ' +
			'роботі.',
	},

	{
		image: addOn2,
		title: 'Допоміжний пристрій для прийому їжі',
		text: 'Цей пристрій дозволяє користувачам легко тримати столовий посуд, такий як виделка чи ложка, протягом ' +
			'тривалого періоду часу. Він підходить для різних розмірів посуду, а зап’ястя можна обертати так, щоб посуд ' +
			'знаходився під бажаним кутом.',
	},

	{
		image: addOn3,
		title: 'Тримач для допоміжних напоїв',
		text: 'Цей пристрій був розроблений, щоб допомогти тримати стандартну банку з-під напоїв. Це було б ідеально для ' +
			'випадків, коли користувач тримає напій протягом тривалого часу, наприклад під час їжі або під час прогулянки.',
	},
]